# YOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralElementDefinitionData..::..YOffset Property
StructuralElementDefinitionData Class See Also
---
Y offset.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double YOffset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property YOffset As Double
	Get
```

Visual C++
---
```text
public:
property double YOffset {
	double get ();
}
```

# See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace